{
    "datapack.displayName": "Datapack Helper Plus (MCF)",
    "datapack.description": "Heavy language features for MCFunction files",
    "datapack.commands.regenerateCache.title": "Regenerate Cache",
    "datapack.config.env.dataVersion": "The version of the completion data, including registries, block definitions, and nbtdoc. Should be an identity in the [version manifest](https://launchermeta.mojang.com/mc/game/version_manifest.json) which was released after `19w40a`. Apart from a version identity, you can also input `Latest release` or `Latest snapshot` here (case-insensitive).",
    "datapack.config.env.dependsOnVanilla": "Whether this datapack depends on the vanilla datapack or not. If this option is enabled, completions for the corresponding data of the vanilla datapack will be provided.",
    "datapack.config.env.permissionLevel": "`function-permission-level` defined in `server.properties`.",
    "datapack.config.env.cmdVersion": "The version of the command tree. Only major versions are available.",
    "datapack.config.features.codeActions": "Whether DHP should provide code actions or not.",
    "datapack.config.features.colors": "Whether DHP should provide color supports or not.",
    "datapack.config.features.completions": "Whether DHP should provide completions or not.",
    "datapack.config.features.documentHighlighting": "Whether DHP should provide document highlighting or not.",
    "datapack.config.features.documentLinks": "Whether DHP should provide document links or not.",
    "datapack.config.features.foldingRanges": "Whether DHP should provide folding ranges or not.",
    "datapack.config.features.formatting": "Whether DHP should provide formatting feature or not.",
    "datapack.config.features.hover": "Whether DHP should provide hover information or not.",
    "datapack.config.features.semanticColoring": "Whether DHP should provide semantic coloring or not.",
    "datapack.config.features.selectionRanges": "Whether DHP should provide selection ranges or not.",
    "datapack.config.features.signatures": "Whether DHP should provide signature information for commands or not.",
    "datapack.config.snippets": "Code snippets.",
    "datapack.config.lint.blockStateBracketSpacing": "Enforce spacing inside the square brackets of block states.",
    "datapack.config.lint.blockStateCommaSpacing": "Enforce spacing around commas in block states. No matter what the settings are, spaces after trailing commas are always removed.",
    "datapack.config.lint.blockStateEqualSpacing": "Enforce spacing around equal signs in block states.",
    "datapack.config.lint.blockStateTrailingComma": "Whether there should be a trailing comma after the last key-value pair in block states or not.",
    "datapack.config.lint.eol": "Enforce the end of line (EOL) character in `mcfunction` files.",
    "datapack.config.lint.nbtArrayBracketSpacing": "Enforce spacing inside the square brackets of NBT arrays.",
    "datapack.config.lint.nbtArrayCommaSpacing": "Enforce spacing around commas in NBT arrays. No matter what the settings are, spaces after trailing commas are always removed.",
    "datapack.config.lint.nbtArraySemicolonSpacing": "Enforce spacing after semicolons in NBT arrays. No matter what the setting is, spaces after the semicolon are always removed if the array is empty.",
    "datapack.config.lint.nbtArrayTrailingComma": "Whether there should be a trailing comma after the last number in NBT arrays or not.",
    "datapack.config.lint.nbtByteSuffix": "Enforce the suffix of NBT byte tags.",
    "datapack.config.lint.nbtCompoundBracketSpacing": "Enforce spacing inside the curly brackets of NBT compounds.",
    "datapack.config.lint.nbtCompoundColonSpacing": "Enforce spacing around colons in NBT compounds.",
    "datapack.config.lint.nbtCompoundCommaSpacing": "Enforce spacing around commas in NBT compounds. No matter what the settings are, spaces after trailing commas are always removed.",
    "datapack.config.lint.nbtCompoundTrailingComma": "Whether there should be a trailing comma after the last key-value pair in NBT compounds or not.",
    "datapack.config.lint.nbtDoubleOmitSuffix": "Whether or not to omit the suffix of NBT double numbers if possible.",
    "datapack.config.lint.nbtDoubleSuffix": "Enforce the suffix of NBT double tags.",
    "datapack.config.lint.nbtFloatSuffix": "Enforce the suffix of NBT float tags.",
    "datapack.config.lint.nbtListBracketSpacing": "Enforce spacing inside the square brackets of NBT lists.",
    "datapack.config.lint.nbtListCommaSpacing": "Enforce spacing around commas in NBT lists. No matter what the settings are, spaces after trailing commas are always removed.",
    "datapack.config.lint.nbtListTrailingComma": "Whether there should be a trailing comma after the last number in NBT lists or not.",
    "datapack.config.lint.nbtLongSuffix": "Enforce the suffix of NBT long tags.",
    "datapack.config.lint.nbtShortSuffix": "Enforce the suffix of NBT short tags.",
    "datapack.config.lint.selectorBracketSpacing": "Enforce spacing inside the square brackets of entity selectors.",
    "datapack.config.lint.selectorCommaSpacing": "Enforce spacing around commas in entity selectors. No matter what the settings are, spaces after trailing commas are always removed.",
    "datapack.config.lint.selectorEqualSpacing": "Enforce spacing around equal signs in entity selectors.",
    "datapack.config.lint.selectorTrailingComma": "Whether there should be a trailing comma after the last key-value pair in entity selectors or not.",
    "datapack.config.lint.timeOmitTickUnit": "Whether or not to omit the tick units (`t`) of time arguments.",
    "datapack.config.lint.blockStateSortKeys": "Enforce the values in a block state to be sorted by the keys.",
    "datapack.config.lint.idOmitDefaultNamespace": "Whether or not the default namespaces in namespaced IDs should be omitted. No matter what the setting is, namespaces in predicates (e.g. `nbt` selector argument, `execute if data`) should always be kept.",
    "datapack.config.lint.nameOfNbtCompoundTagKeys": "Enforce a consistent NBT compound key naming convention.",
    "datapack.config.lint.nameOfObjectives": "Enforce a consistent scoreboard objective naming convention.",
    "datapack.config.lint.nameOfTags": "Enforce a consistent entity tag naming convention.",
    "datapack.config.lint.nameOfTeams": "Enforce a consistent team naming convention.",
    "datapack.config.lint.nbtBoolean": "Whether to use boolean literals to represent boolean-like NBT bytes or not.",
    "datapack.config.lint.nbtCompoundKeyQuote": "Whether to quote keys in NBT compounds or not.",
    "datapack.config.lint.nbtCompoundKeyQuoteType": "Enforce the type of NBT compound key quotation marks.",
    "datapack.config.lint.nbtCompoundSortKeys": "Whether to sort keys in NBT compounds or not.",
    "datapack.config.lint.nbtPathQuote": "Whether to quote keys in NBT paths or not.",
    "datapack.config.lint.nbtPathQuoteType": "Enforce the type of NBT path key quotation marks. Because of [MC-175504](https://bugs.mojang.com/browse/MC-175504) you should _never_ use single quotes for NBT path keys.",
    "datapack.config.lint.nbtStringQuote": "Whether to quote string arguments or not.",
    "datapack.config.lint.nbtStringQuoteType": "Enforce the type of NBT string quotation marks.",
    "datapack.config.lint.nbtTypeCheck": "Check the types of the NBT values.",
    "datapack.config.lint.selectorKeyQuote": "Whether to quote entity selector keys or not.",
    "datapack.config.lint.selectorKeyQuoteType": "Enforce the type of entity selector key quotation marks.",
    "datapack.config.lint.selectorSortKeys": "Enforce the values in an entity selector to be sorted by the keys.",
    "datapack.config.lint.strictAdvancementCheck": "Show diagnostics for advancements that don't exist in the current workspace.",
    "datapack.config.lint.strictBlockCheck": "Show diagnostics for blocks that don't exist in the registry.",
    "datapack.config.lint.strictBlockTagCheck": "Show diagnostics for block tags that don't exist in the current workspace.",
    "datapack.config.lint.strictBossbarCheck": "Show diagnostics for bossbars that haven't been defined in the workspace.",
    "datapack.config.lint.strictDimensionTypeCheck": "Show diagnostics for dimensions that don't exist in the registry.",
    "datapack.config.lint.strictEnchantmentCheck": "Show diagnostics for enchantments that don't exist in the registry.",
    "datapack.config.lint.strictEntityTypeCheck": "Show diagnostics for entity types that don't exist in the registry.",
    "datapack.config.lint.strictEntityTypeTagCheck": "Show diagnostics for entity type tags that don't exist in the current workspace.",
    "datapack.config.lint.strictFluidCheck": "Show diagnostics for fluids that don't exist in the registry.",
    "datapack.config.lint.strictFluidTagCheck": "Show diagnostics for fluid tags that don't exist in the current workspace.",
    "datapack.config.lint.strictFunctionCheck": "Show diagnostics for functions that don't exist in the current workspace.",
    "datapack.config.lint.strictFunctionTagCheck": "Show diagnostics for function tags that don't exist in the current workspace.",
    "datapack.config.lint.strictItemCheck": "Show diagnostics for items that don't exist in the registry.",
    "datapack.config.lint.strictItemTagCheck": "Show diagnostics for item tags that don't exist in the current workspace.",
    "datapack.config.lint.strictLootTableCheck": "Show diagnostics for loot tables that don't exist in the current workspace.",
    "datapack.config.lint.strictMobEffectCheck": "Show diagnostics for mob effects that don't exist in the registry.",
    "datapack.config.lint.strictMotiveCheck": "Show diagnostics for painting motives that don't exist in the registry.",
    "datapack.config.lint.strictObjectiveCheck": "Show diagnostics for scoreboard objectives that haven't been defined in the workspace.",
    "datapack.config.lint.strictParticleTypeCheck": "Show diagnostics for particle types that don't exist in the registry.",
    "datapack.config.lint.strictPotionCheck": "Show diagnostics for potions that don't exist in the registry.",
    "datapack.config.lint.strictPredicateCheck": "Show diagnostics for predicates that don't exist in the current workspace.",
    "datapack.config.lint.strictRecipeCheck": "Show diagnostics for recipes that don't exist in the current workspace.",
    "datapack.config.lint.strictSoundEventCheck": "Show diagnostics for sound events that don't exist in the registry.",
    "datapack.config.lint.strictStorageCheck": "Show diagnostics for storages that haven't been defined in the workspace.",
    "datapack.config.lint.strictTagCheck": "Show diagnostics for tags that haven't been defined in the workspace.",
    "datapack.config.lint.strictTeamCheck": "Show diagnostics for teams that haven't been defined in the workspace.",
    "datapack.config.lint.stringQuote": "Whether to quote string arguments or not.",
    "datapack.config.lint.stringQuoteType": "Enforce the type of string argument quotation marks."
}
